app/controllers/api/v1/poketeams_controller.rb

SELECT "poketeams".* FROM "poketeams"
---
    def index
        poketeams = Poketeam.all

INSERT INTO "poketeams" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Buzzy"], ["user_id", 9], ["created_at", "2018-10-02 08:30:10.448717"], ["updated_at", "2018-10-02 08:30:10.448717"]]
---
    def create
        poketeam = Poketeam.new(poketeam_params)
        poketeam.user_id = current_user.id
        if poketeam.save

SELECT  "poketeams".* FROM "poketeams" WHERE "poketeams"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def update
        poketeam = Poketeam.find(params["id"])