app/controllers/api/v1/pokemons_controller.rb

    def create
        pokeData = Pokemon.get_pokemon(params["name"])
        @pokemon = Pokemon.new(pokemon_params)
        @pokemon.averagepokemonstats = pokeData
        if @pokemon.save
---
INSERT INTO "pokemons" ("nickname", "name", "level", "averagepokemonstats", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def delete
        @pokemon = Pokemon.find(params[:id])
        @pokemon.destroy
---
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "pokemons" WHERE "pokemons"."id" = $1  [["id", 7]]