app/controllers/pokemons_controller.rb

INSERT INTO "pokemons" ("nickname", "name", "nature", "level", "averagepokemonstats", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
        pokeData = Pokemon.get_pokemon(params["name"])
        @pokemon = Pokemon.new(pokemon_params)
        @pokemon.averagepokemonstats = JSON.stringify(pokeData)
        if @pokemon.save

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "pokemons" SET "name" = $1, "nature" = $2, "level" = $3, "updated_at" = $4 WHERE "pokemons"."id" = $5  [["name", nil], ["nature", "adamant"], ["level", 10], ["updated_at", "2018-09-28 14:15:56.759111"], ["id", 1]]
---
    def update
        @pokemon = Pokemon.find(params["id"])
        @pokemon.update(pokemon_params)

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "pokemons" WHERE "pokemons"."id" = $1  [["id", 8]]
---
    def delete
        @pokemon = Pokemon.find(params[:id])
        @pokemon.destroy