app/controllers/poketeams_controller.rb

    def index
        @poketeams = Poketeam.all
---
SELECT "poketeams".* FROM "poketeams"

    def create
        @poketeam = Poketeam.new(poketeam_params)
        if @poketeam.save
---
INSERT INTO "poketeams" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "team sprocket"], ["user_id", 1], ["created_at", "2018-09-30 14:04:53.323471"], ["updated_at", "2018-09-30 14:04:53.323471"]]

    def update
        @poketeam = Poketeam.find(params["id"])
        @poketeam.update(poketeam_params)
---
SELECT  "poketeams".* FROM "poketeams" WHERE "poketeams"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "poketeams" SET "name" = $1, "updated_at" = $2 WHERE "poketeams"."id" = $3  [["name", "Team Rocket"], ["updated_at", "2018-09-30 14:17:19.594043"], ["id", 2]]

    def delete
        @poketeam = Poketeam.find(params[:id])
        @poketeam.destroy
---
SELECT  "poketeams".* FROM "poketeams" WHERE "poketeams"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "poketeams" WHERE "poketeams"."id" = $1  [["id", 3]]