app/models/pokemon.rb

    def self.get_pokemon(name)
        response = RestClient::Request.execute(
            method: :get,
            url: "https://pokeapi.co/api/v2/pokemon/#{name}/"
        )
        data = JSON.parse(response)

    #filters the parsed response to include the key/value pairs as specified by the keys in array_keys
        pokemon_obj = {}
        array_keys = ["id", "base_experience", "abilities", "stats", "name", "sprites", "species", "types"]
        data.each{ |key, value|
            if array_keys.include?(key)
---
SELECT "pokemons".* FROM "pokemons"

    def self.find_all(array)
        modarr = array.first.split(',').map{|id| id.to_i}
        Pokemon.select{ |pokemon|
---
SELECT "pokemons".* FROM "pokemons"